Revit 2027 API
DirectShape.AppendShape(IList<GeometryObject>, DirectShapeTargetViewType) Method
 Appends the collection of GeometryObjects into the model or view specific shape representation stored in this DirectShape. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AppendShape(
	IList<GeometryObject> pGeomArr,
	DirectShapeTargetViewType viewType
)
Public Sub AppendShape (
	pGeomArr As IList(Of GeometryObject),
	viewType As DirectShapeTargetViewType
)
public:
void AppendShape(
	IList<GeometryObject^>^ pGeomArr,
	DirectShapeTargetViewType viewType
)
member AppendShape :
        pGeomArr : IList<GeometryObject> *
        viewType : DirectShapeTargetViewType -> unit
Parameters
pGeomArr IList<GeometryObject>
 Shape expressed as a collection of GeometryObjects. For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve. For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve.
viewType DirectShapeTargetViewType
 Passing DirectShapeTargetViewType.Default as view type will cause the default shape to be appended.
Exceptions
Exception | Condition
ArgumentException |  At least one member of pGeomArr does not satisfy DirectShape validation criteria.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be joined with the appended geometry. It is up to the caller to ensure that the combination of geometry will have the correct appearance in Revit.
See Also
Reference
DirectShape Class
AppendShape Overload
Autodesk.Revit.DB Namespace